Рабочая.Задачи2/src/InformationRegisters/ЦБР_СостоянияЗаданий/ЦБР_СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СостоянияЗаданий</name>
  <resources>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательАРМ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_СтатусыЗадач/ЦБР_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СтатусыЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_СостоянияЗадач/ЦБР_СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СостоянияЗадач</name>
  <resources>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательАРМ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.ЦБР_РольВЗадаче</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_РольВЗадаче/ЦБР_РольВЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_РольВЗадаче</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>КураторИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>КураторПостановщика</name>
  </enumValues>
  <enumValues>
    <name>ВладелецЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительРазработчик</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительАналитик</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_ВидыЧасовПоЗадачам/ЦБР_ВидыЧасовПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ВидыЧасовПоЗадачам</name>
  <enumValues>
    <name>ИТС</name>
  </enumValues>
  <enumValues>
    <name>Установка</name>
  </enumValues>
  <enumValues>
    <name>Платные</name>
  </enumValues>
  <enumValues>
    <name>Бесплатные</name>
  </enumValues>
  <enumValues>
    <name>Демо</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_СтатусЗаписиКалендаря/ЦБР_СтатусЗаписиКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_СтатусЗаписиКалендаря</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Начал</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Documents/ЦБР_Задание/ЦБР_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦБР_Задание</name>
  <registerRecords>AccumulationRegister.ЦБР_ЧасыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_СогласованоЗакрытоЧасов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_КоличествоЧасовСотрудниковПоЗадачам</registerRecords>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПереписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрикрепленныйФайл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийКСогласованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетГарантииОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДополнительное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочнаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадачу</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтруктуру</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыСогласованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУточнениеТребований</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланСтарый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Предшественники</name>
    <attributes>
      <name>Предшественник</name>
      <type>
        <types>DocumentRef.ЦБР_Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗависимости</name>
      <type>
        <types>EnumRef.ЦБР_ТипЗависимостиЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭффективныеЧасы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеКалендаря</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧасыЗП</name>
    <attributes>
      <name>ПериодЗП</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаСчетКомпании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Рабочая.Задачи2/src/CommonModules/ЦБР_СтатусыОбъектовПолныеПрава/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатусыЗадачи(СсылкаНаЗадачу, ОтветНаЗапрос = Ложь) Экспорт

	//черновик - новый
	Если СсылкаНаЗадачу.ВзялиВРаботу Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СостоянияЗаданий.Задание КАК Задание
		|ИЗ
		|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
		|ГДЕ
		|	ЦБР_СостоянияЗаданий.Состояние = &СостояниеЧерновик
		|	И ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу";
		
		Запрос.УстановитьПараметр("СсылкаНаЗадачу", СсылкаНаЗадачу);
		Запрос.УстановитьПараметр("СостояниеЧерновик", Перечисления.ЦБР_Состояние.Черновик);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УстановитьСтатусЗадания(ВыборкаДетальныеЗаписи.Задание, Перечисления.ЦБР_Состояние.Новый);
		КонецЦикла;
	КонецЕсли;

	ТЧкоманда = СсылкаНаЗадачу.Команда.Выгрузить();
	ТЧкоманда.Свернуть("Исполнитель");
	МассивПользователей = ТЧкоманда.ВыгрузитьКолонку("Исполнитель");	
	
	ТЗ_АктуальныеСтатусыЗадачи = ПолучитьАктуальныйСтатусЗадачиПользователей(СсылкаНаЗадачу, МассивПользователей);
	
	Для каждого Исполнители Из СсылкаНаЗадачу.Команда Цикл
		СтатусЗадачи = ВычислитьСтатусЗадачи(СсылкаНаЗадачу, Исполнители.Исполнитель, Исполнители.Роль);	
		
		НайденнаяСтрокаСтатуса = ТЗ_АктуальныеСтатусыЗадачи.Найти(Исполнители.Исполнитель);
		Если НайденнаяСтрокаСтатуса <> Неопределено Тогда
			ПоследнийСтатус = НайденнаяСтрокаСтатуса.СостояниеЗадачи; 
		Иначе
			ПоследнийСтатус = Перечисления.ЦБР_Состояние.Новый;
		КонецЕсли;
		
		Если СтатусЗадачи <> ПоследнийСтатус Тогда 
			Если НЕ (ПоследнийСтатус = Перечисления.ЦБР_Состояние.ЗапросИнформации И ОтветНаЗапрос = Ложь) Тогда
				МенеджерЗаписи = РегистрыСведений.ЦБР_СтатусыЗадач.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
				МенеджерЗаписи.Задача = СсылкаНаЗадачу;
				МенеджерЗаписи.Пользователь = Исполнители.Исполнитель; 
				МенеджерЗаписи.СостояниеЗадачи = СтатусЗадачи;
				МенеджерЗаписи.Записать(); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ЦБР_СостоянияЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задача.Установить(СсылкаНаЗадачу);
	НаборЗаписей.Записать();

	ТЗ_АктуальныеСтатусыЗадачи = ПолучитьАктуальныйСтатусЗадачиПользователей(СсылкаНаЗадачу, МассивПользователей);

	НаборЗаписей = РегистрыСведений.ЦБР_СостоянияЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задача.Установить(СсылкаНаЗадачу);
	ТЧкоманда = СсылкаНаЗадачу.Команда.Выгрузить();
	ТЧкоманда.Свернуть("Исполнитель, Роль");
	Длительность = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьСуммуОценокПоЗадаче(СсылкаНаЗадачу);
	Для каждого Исполнители Из ТЧкоманда Цикл
		
		НайденнаяСтрокаСтатуса = ТЗ_АктуальныеСтатусыЗадачи.Найти(Исполнители.Исполнитель);
		Если НайденнаяСтрокаСтатуса <> Неопределено Тогда
			ПоследнийСтатус = НайденнаяСтрокаСтатуса.СостояниеЗадачи; 
		Иначе
			ПоследнийСтатус = Перечисления.ЦБР_Состояние.Новый;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Задача = СсылкаНаЗадачу;
		НоваяЗапись.ПользовательАРМ = Исполнители.Исполнитель;
		НоваяЗапись.ТрудозатратыПлан = Длительность;
		НоваяЗапись.Клиент = СсылкаНаЗадачу.Заказчик;            
		НоваяЗапись.Менеджер = СсылкаНаЗадачу.Постановщик;
		НоваяЗапись.Состояние = ПоследнийСтатус;  
		НоваяЗапись.Роль = Исполнители.Роль;
		
	КонецЦикла;
	НаборЗаписей.Записать();
	
	ЦБР_ТребуетВниманияПолныеПрава.ЦБР_ЗаписьОбъектаТребуетВнимание(СсылкаНаЗадачу,  Ложь);
	
КонецПроцедуры

Процедура УстановитьСтатусЗадания(СсылкаНаЗадание, НовыйСтатус) Экспорт
	
	МассивПользователей = Новый Массив();
	Если ЗначениеЗаполнено(СсылкаНаЗадание.Исполнитель) Тогда 
		МассивПользователей.Добавить(СсылкаНаЗадание.Исполнитель);
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаЗадание.Постановщик) Тогда 
		МассивПользователей.Добавить(СсылкаНаЗадание.Постановщик);
	КонецЕсли;
			
	СвернутыйМассив = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПользователей);
	
	РеквизитыЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЗадание, "ПредыдущееЗадание, ТрудозатратыПлан"); 
	
	Если НовыйСтатус = Перечисления.ЦБР_Состояние.Согласован Тогда 
		Если ЗначениеЗаполнено(РеквизитыЗадания.ПредыдущееЗадание) Тогда
			СтатусПредыдущегоЗадания = ПолучитьАктуальныйСтатусЗадания(РеквизитыЗадания.ПредыдущееЗадание);
			Если СтатусПредыдущегоЗадания <> Перечисления.ЦБР_Состояние.Выполнен 
				И СтатусПредыдущегоЗадания <> Перечисления.ЦБР_Состояние.Закрыт Тогда
				НовыйСтатус = Перечисления.ЦБР_Состояние.Запланировано;
			КонецЕсли;	 
		КонецЕсли;	
	КонецЕсли;	
	
	НачатьТранзакцию();
	
	Попытка
		НаборЗаписей = РегистрыСведений.ЦБР_СостоянияЗаданий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(СсылкаНаЗадание);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.ЦБР_СостоянияЗаданий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(СсылкаНаЗадание);
		
		Для Каждого Пользователь Из СвернутыйМассив Цикл 
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Задание          = СсылкаНаЗадание;
			НоваяЗапись.ПользовательАРМ  = Пользователь;
			НоваяЗапись.ТрудозатратыПлан = СсылкаНаЗадание.ТрудозатратыПлан;              
			НоваяЗапись.Клиент           = СсылкаНаЗадание.СсылкаНаЗадачу.Заказчик;            
			НоваяЗапись.Менеджер         = СсылкаНаЗадание.СсылкаНаЗадачу.Постановщик;
			НоваяЗапись.Состояние        = НовыйСтатус;   	
		КонецЦикла;          
		
		НаборЗаписей.Записать();	
		
		Если НовыйСтатус = Перечисления.ЦБР_Состояние.Выполнен Тогда
			ПеревестиПодчиненныеЗаданияИзСтатусаЗапланировано(СсылкаНаЗадание);  
		КонецЕсли;
		
		УстановитьСтатусыЗадачи(СсылкаНаЗадание.СсылкаНаЗадачу);
		
		ЦБР_ЗадачиЗаданияВызовСервера.ДобавитьЧасыПоЭтапу(СсылкаНаЗадание); 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();             
		
		ЗаписьЖурналаРегистрации("Ошибка ЦБР", УровеньЖурналаРегистрации.Ошибка, , ,
		"При установке статуса произошла ошибка." + Символы.ПС +
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры 

Процедура ПеревестиПодчиненныеЗаданияИзСтатусаЗапланировано(СсылкаНаЗадание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СостоянияЗаданий.Задание КАК Задание,
		|	ЦБР_СостоянияЗаданий.Задание.Исполнитель КАК Исполнитель,
		|	ЦБР_СостоянияЗаданий.Задание.Аналитик КАК Аналитик,
		|	ЦБР_СостоянияЗаданий.Задание.Постановщик КАК Постановщик,
		|	ЦБР_СостоянияЗаданий.ТрудозатратыПлан КАК ТрудозатратыПлан,
		|	ЦБР_СостоянияЗаданий.Клиент КАК Клиент,
		|	ЦБР_СостоянияЗаданий.Менеджер КАК Менеджер,
		|	ЦБР_СостоянияЗаданий.ПользовательАРМ КАК ПользовательАРМ,
		|	ВЫБОР
		|		КОГДА ЦБР_СостоянияЗаданий.Задание.ЧасыСогласованы
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЦБР_Состояние.Согласован)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЦБР_Состояние.Новый)
		|	КОНЕЦ КАК Состояние
		|ИЗ
		|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
		|ГДЕ
		|	ЦБР_СостоянияЗаданий.Состояние = ЗНАЧЕНИЕ(Перечисление.ЦБР_Состояние.Запланировано)
		|	И ЦБР_СостоянияЗаданий.Задание.ПредыдущееЗадание = &ПредыдущееЗадание";
	
	Запрос.УстановитьПараметр("ПредыдущееЗадание", СсылкаНаЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ЦБР_СостоянияЗаданий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задание.Установить(ВыборкаДетальныеЗаписи.Задание);  
		НаборЗаписей.Отбор.ПользовательАРМ.Установить(ВыборкаДетальныеЗаписи.ПользовательАРМ);  
		НаборЗаписей.Отбор.Клиент.Установить(ВыборкаДетальныеЗаписи.Клиент);  
		НаборЗаписей.Отбор.Менеджер.Установить(ВыборкаДетальныеЗаписи.Менеджер);  
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Задание          = ВыборкаДетальныеЗаписи.Задание;
		НоваяЗапись.ПользовательАРМ  = ВыборкаДетальныеЗаписи.ПользовательАРМ;
		НоваяЗапись.ТрудозатратыПлан = ВыборкаДетальныеЗаписи.ТрудозатратыПлан;              
		НоваяЗапись.Клиент           = ВыборкаДетальныеЗаписи.Клиент;            
		НоваяЗапись.Менеджер         = ВыборкаДетальныеЗаписи.Менеджер;
		НоваяЗапись.Состояние        = ВыборкаДетальныеЗаписи.Состояние;   	
	    НаборЗаписей.Записать();	
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьАктуальныйСтатусЗадачиПользователей(СсылкаНаЗадачу, МассивПользователей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_СтатусыЗадачСрезПоследних.Пользователь КАК Пользователь,
		|	ЦБР_СтатусыЗадачСрезПоследних.СостояниеЗадачи КАК СостояниеЗадачи
		|ИЗ
		|	РегистрСведений.ЦБР_СтатусыЗадач.СрезПоследних(
		|			,
		|			Задача = &ЗадачаСсылка
		|				И Пользователь В (&МассивПользователей)) КАК ЦБР_СтатусыЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗадачаСсылка", СсылкаНаЗадачу);
	Запрос.УстановитьПараметр("МассивПользователей", МассивПользователей);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат  РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьАктуальныйСтатусЗадачиПользователя(СсылкаНаЗадачу, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_СтатусыЗадачСрезПоследних.Пользователь КАК Пользователь,
		|	ЦБР_СтатусыЗадачСрезПоследних.СостояниеЗадачи КАК СостояниеЗадачи
		|ИЗ
		|	РегистрСведений.ЦБР_СтатусыЗадач.СрезПоследних(
		|			,
		|			Задача = &ЗадачаСсылка
		|				И Пользователь = &Пользователь) КАК ЦБР_СтатусыЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗадачаСсылка", СсылкаНаЗадачу);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.ЦБР_Состояние.Новый;
	Иначе
	    Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат  Выборка.СостояниеЗадачи;
	КонецЕсли;
	
КонецФункции  

Функция ПолучитьАктуальныйСтатусЗадания(СсылкаНаЗадание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_СостоянияЗаданий.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
		|ГДЕ
		|	ЦБР_СостоянияЗаданий.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", СсылкаНаЗадание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.ЦБР_Состояние.Новый;
	Иначе
	    Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Состояние;
	КонецЕсли;
	
КонецФункции

Функция ВычислитьСтатусЗадачи(Задача, Пользователь, Роль) Экспорт

	СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Задача, Пользователь);
	
	//Если СостояниеЗадачи = Перечисления.ЦБР_Состояние.Выполнен Тогда
	//	Возврат Перечисления.ЦБР_Состояние.Выполнен;
	//КонецЕсли;
	
	Если Не Задача.ВзялиВРаботу Тогда
		Возврат Перечисления.ЦБР_Состояние.Черновик;
	КонецЕсли;  
	
	Если ЗакрытиеЗадачи(Задача) Тогда
		Возврат Перечисления.ЦБР_Состояние.Закрыт;
	КонецЕсли;	
	
	ТЗПриоритетовСтатусов = ПолучитьТЗПриоритетов();
	
	Запрос = Новый Запрос;
	Запрос.Текст =       
	"ВЫБРАТЬ
	|	ТЗ_Приоритеты.Статус КАК Статус,
	|	ТЗ_Приоритеты.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ТЗ_ПриоритетСтатусов
	|ИЗ
	|	&ТЗ_Приоритеты КАК ТЗ_Приоритеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ЦБР_СостоянияЗаданий.Состояние, ЗНАЧЕНИЕ(Перечисление.ЦБР_Состояние.ПустаяСсылка)) КАК Состояние,
	|	ТЗ_ПриоритетСтатусов.Приоритет КАК Приоритет
	|ИЗ
	|	Документ.ЦБР_Задание КАК ЦБР_Задание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТЗ_ПриоритетСтатусов КАК ТЗ_ПриоритетСтатусов
	|			ПО ЦБР_СостоянияЗаданий.Состояние = ТЗ_ПриоритетСтатусов.Статус
	|		ПО (ЦБР_СостоянияЗаданий.Задание = ЦБР_Задание.Ссылка)
	|ГДЕ
	|	ЦБР_Задание.ПометкаУдаления = ЛОЖЬ
	|	И ЦБР_Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу
	|   &ДопУсловие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	
	Если Роль = Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя Или ИсполнительКуратор(Задача, Пользователь, Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловие", "И (ЦБР_Задание.Исполнитель В (&Исполнитель) ИЛИ  ЦБР_Задание.Исполнитель = &КураторИсполнителя)");
		Запрос.УстановитьПараметр("Исполнитель", ПолучитьСотрудниковКуратора(Пользователь)); 
		Запрос.УстановитьПараметр("КураторИсполнителя", Пользователь); 
	ИначеЕсли Роль = Перечисления.ЦБР_РольВЗадаче.Исполнитель 
		ИЛИ Роль = Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик 
		ИЛИ Роль = Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловие", "И ЦБР_Задание.Исполнитель = &Исполнитель");
		Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловие", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТЗ_Приоритеты", ТЗПриоритетовСтатусов);   
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Если Выборка.Состояние = Перечисления.ЦБР_Состояние.Черновик Тогда
			Возврат Перечисления.ЦБР_Состояние.Новый;
		Иначе	
			Возврат Выборка.Состояние; 
		КонецЕсли;
	Иначе      
		Возврат Перечисления.ЦБР_Состояние.Новый;
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьТЗПриоритетов()  
	
	ТЗ_ПриоритетовСтатусов = Новый ТаблицаЗначений;
	ТЗ_ПриоритетовСтатусов.Колонки.Добавить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.ЦБР_Состояние"));
	ТЗ_ПриоритетовСтатусов.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0))); 
	
	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.ПустаяСсылка();
	НС.Приоритет = 99;

	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.Черновик;
	НС.Приоритет = 99;
	
	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.НаСогласованииСроков;
	//НС.Приоритет = 1;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.НаСогласованииОценки;
	//НС.Приоритет = 1;

	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.НаСогласовании;
	НС.Приоритет = 1;
	
	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.Новый;
	НС.Приоритет = 2;
	
	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.НаТестировании;
	//НС.Приоритет = 3;

	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.ВРаботе;
	НС.Приоритет = 3;  
	
	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.НеСогласован;
	НС.Приоритет = 3;  

	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.ЗапросИнформации;
	НС.Приоритет = 3;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.Приостановлен;
	//НС.Приоритет = 3;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.УточнениеТребований;
	//НС.Приоритет = 3;

	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.Согласован;
	НС.Приоритет = 4;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.СрокиСогласованы;
	//НС.Приоритет = 4;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.ОценкаСогласована;
	//НС.Приоритет = 4;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.Отменен;
	//НС.Приоритет = 8;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.СрокиНеСогласованы;
	//НС.Приоритет = 9;

	//НС = ТЗ_ПриоритетовСтатусов.Добавить();
	//НС.Статус = Перечисления.ЦБР_Состояние.ОценкаНеСогласована;
	//НС.Приоритет = 9;
	
	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.Запланировано;
	НС.Приоритет = 10;
	
	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.Выполнен;
	НС.Приоритет = 11;
	
	НС = ТЗ_ПриоритетовСтатусов.Добавить();
	НС.Статус = Перечисления.ЦБР_Состояние.Закрыт;
	НС.Приоритет = 12;

	Возврат ТЗ_ПриоритетовСтатусов;
	
КонецФункции

Функция ПолучитьСотрудниковКуратора(Руководитель)
	Подчиненные = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_ГруппыСотрудниковСостав.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|ГДЕ
	|	ЦБР_ГруппыСотрудниковСостав.Ссылка.Руководитель = &Руководитель
	|	И ЦБР_ГруппыСотрудниковСостав.Недействителен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Руководитель", Руководитель);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Подчиненные.Добавить(Выборка.Пользователь);
	КонецЦикла;
	
	Возврат Подчиненные;
КонецФункции

Функция ЗакрытиеЗадачи(Задача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦБР_СостоянияЗаданий.Задание) КАК Задание,
		|	ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу КАК Задача
		|ПОМЕСТИТЬ ВТ_НевыполненныеЗадачи
		|ИЗ
		|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
		|ГДЕ
		|	ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу
		|	И ЦБР_СостоянияЗаданий.Состояние <> &СостояниеВыполнено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦБР_СостоянияЗаданий.Задание) КАК Задание,
		|	ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу КАК Задача
		|ПОМЕСТИТЬ ВТ_ВыполненныеЗадачи
		|ИЗ
		|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
		|ГДЕ
		|	ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу
		|	И ЦБР_СостоянияЗаданий.Состояние = &СостояниеВыполнено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦБР_СостоянияЗаданий.Задание.СсылкаНаЗадачу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.СсылкаНаЗадачу КАК Задача,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦБР_ЗаданиеЭффективныеЧасы.Ссылка) КАК Количество
		|ПОМЕСТИТЬ ВТ_БезРеализаций
		|ИЗ
		|	Документ.ЦБР_Задание.ЧасыЗП КАК ЦБР_ЗаданиеЭффективныеЧасы
		|ГДЕ
		|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.СсылкаНаЗадачу = &СсылкаНаЗадачу
		|	И ЦБР_ЗаданиеЭффективныеЧасы.Реализация = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|			И НЕ ЦБР_ЗаданиеЭффективныеЧасы.ЗаСчетКомпании
		|			И НЕ ЦБР_ЗаданиеЭффективныеЧасы.Зачтено
		|			И НЕ ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.ВидЧаса = &Демо 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.СсылкаНаЗадачу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыполненныеЗадачи.Задание КАК Задание,
		|	ВТ_ВыполненныеЗадачи.Задача КАК Задача
		|ИЗ
		|	ВТ_ВыполненныеЗадачи КАК ВТ_ВыполненныеЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НевыполненныеЗадачи КАК ВТ_НевыполненныеЗадачи
		|		ПО ВТ_ВыполненныеЗадачи.Задача = ВТ_НевыполненныеЗадачи.Задача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БезРеализаций КАК ВТ_БезРеализаций
		|		ПО ВТ_ВыполненныеЗадачи.Задача = ВТ_БезРеализаций.Задача
		|ГДЕ
		|	ВТ_НевыполненныеЗадачи.Задание ЕСТЬ NULL
		|	И ВТ_БезРеализаций.Количество ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СостояниеВыполнено", Перечисления.ЦБР_Состояние.Выполнен); 
	Запрос.УстановитьПараметр("Демо", Перечисления.ЦБР_ВидыЧасовПоЗадачам.Демо);
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		 Возврат Истина;
	КонецЕсли;	
	 
	Возврат Ложь; 
	
КонецФункции	

Функция ЕстьСтартованныеДействия(СсылкаНаОбъект) Экспорт
	
	Статусы = Новый Массив();
	Статусы.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	Статусы.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЦБР_ЗаписиРабочегоКалендаря.Ссылка) КАК КоличествоСтартованныхДействий
	|ИЗ
	|	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	|ГДЕ
	|	ЦБР_ЗаписиРабочегоКалендаря.Статус В (&Статусы)
	|	И НЕ ЦБР_ЗаписиРабочегоКалендаря.ПометкаУдаления
	|	И ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка = &СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Статусы", Статусы);  
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		 Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗадачаСсылка", "ЗаданиеСсылка"); 
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.КоличествоСтартованныхДействий > 0;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ИсполнительКуратор(Задача, Исполнитель, Роль) Экспорт
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_ЗадачаКоманда.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
		|ГДЕ
		|	ЦБР_ЗадачаКоманда.Ссылка = &Ссылка
		|	И ЦБР_ЗадачаКоманда.Исполнитель = &Исполнитель
		|	И ЦБР_ЗадачаКоманда.Роль = &Роль";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("Ссылка", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции	

//Функция ДанныеСтруктурыЗадания(СсылкаНаЗадание) Экспорт

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//		|	ЦБР_СтруктураЗадач.Ссылка КАК СсылкаНаЗадание,
//		|	ЦБР_СтруктураЗадач.Аналитик КАК Аналитик,
//		|	ЦБР_СтруктураЗадач.Владелец КАК Задача,
//		|	ЦБР_СтруктураЗадач.Владелец.Заказчик КАК Заказчик,
//		|	ЦБР_СтруктураЗадач.Владелец.Постановщик КАК Постановщик,
//		|	ЦБР_СтруктураЗадач.Исполнитель КАК Исполнитель,
//		|	ЦБР_СтруктураЗадач.ТрудозатратыПлан КАК ТрудозатратыПлан
//		|ИЗ
//		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
//		|ГДЕ
//		|	ЦБР_СтруктураЗадач.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", СсылкаНаЗадание);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		СтруктураЗадания = Новый Структура;
//		СтруктураЗадания.Вставить("СсылкаНаЗадание",СсылкаНаЗадание);
//		СтруктураЗадания.Вставить("Аналитик",Выборка.Аналитик);
//		СтруктураЗадания.Вставить("Задача",Выборка.Задача);
//		СтруктураЗадания.Вставить("Заказчик",Выборка.Заказчик);
//		СтруктураЗадания.Вставить("Постановщик",Выборка.Постановщик);
//		СтруктураЗадания.Вставить("Исполнитель",Выборка.Исполнитель);
//		СтруктураЗадания.Вставить("ТрудозатратыПлан",Выборка.ТрудозатратыПлан);	
//		
//		Возврат СтруктураЗадания;
//	КонецЕсли;                                                         
//	
//	Возврат Неопределено;
//		
//КонецФункции

//Процедура ОтправитьНаСогласованиеНаСервере(СсылкаСтруктурыЗадания, СообщитьОбОшибке = Ложь) Экспорт
//	
//	РеквизитыСтруктурыЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаСтруктурыЗадания, "ТрудозатратыПлан,Владелец,Наименование,ОценкаСогласована,ОплатаПоФакту");
//	РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСтруктурыЗадания.Владелец, "ТипОценкиЗадачи,Постановщик"); 
//	
//	ОбъектСтруктурыЗадания = СсылкаСтруктурыЗадания.ПолучитьОбъект();
//	
//	Если НЕ ЗначениеЗаполнено(ОбъектСтруктурыЗадания.ТрудозатратыПлан) Тогда
//		Если Не ОбъектСтруктурыЗадания.ОплатаПоФакту Тогда
//			Если СообщитьОбОшибке Тогда
//				ОбщегоНазначения.СообщитьПользователю("Должна быть точная оценка или оценка ""По факту""!");
//			КонецЕсли;
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Получатели = Новый Массив;
//	Получатели.Добавить(РеквизитыЗадачи.Постановщик);
//	
//	ОтправленныеЭтапы = Новый Массив;
//	ОтправленныеЭтапы.Добавить(РеквизитыСтруктурыЗадания.Наименование);
//	
//	НовоеСостояние = Неопределено;
//	
//	Если РеквизитыЗадачи.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту Тогда
//		РеквизитыСтруктурыЗадания.ОценкаСогласована = Истина;
//		НовоеСостояние = Перечисления.ЦБР_Состояние.Согласован; 
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(РеквизитыСтруктурыЗадания.Владелец, "СогласоватьОценку", Получатели, ОтправленныеЭтапы);
//	ИначеЕсли РеквизитыЗадачи.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные И (РеквизитыСтруктурыЗадания.ОплатаПоФакту
//		ИЛИ ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПредсогласованныеЧасы(РеквизитыСтруктурыЗадания.Владелец) >= РеквизитыСтруктурыЗадания.ТрудозатратыПлан)Тогда 
//		ОбъектСтруктурыЗадания.ОценкаСогласована = Истина;
//		НовоеСостояние = Перечисления.ЦБР_Состояние.Согласован; 
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(РеквизитыСтруктурыЗадания.Владелец, "СогласоватьОценку", Получатели, ОтправленныеЭтапы);	
//	Иначе 
//		НовоеСостояние = Перечисления.ЦБР_Состояние.НаСогласовании; 
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(РеквизитыСтруктурыЗадания.Владелец, "СогласованиеОценки", Получатели, ОтправленныеЭтапы);	
//	КонецЕсли;
//	
//	ОбъектСтруктурыЗадания.Записать();
//	
//	Если ЗначениеЗаполнено(НовоеСостояние) Тогда
//		ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусСтруктурыЗадания(СсылкаСтруктурыЗадания, НовоеСостояние);	
//	КонецЕсли;
//	
//	Если НовоеСостояние = Перечисления.ЦБР_Состояние.Согласован Тогда
//		СоздатьСогласованноеЗадание(ОбъектСтруктурыЗадания,РеквизитыСтруктурыЗадания,РеквизитыЗадачи)
//	КонецЕсли;
//	
//КонецПроцедуры 

//&НаСервере
//Процедура СоздатьСогласованноеЗадание(Этап,РеквизитыСтруктурыЗадания,РеквизитыЗадачи) Экспорт
//	
//	Пересогласование = Документы.ЦБР_Задание.ПустаяСсылка();
//	Задание          = Документы.ЦБР_Задание.СоздатьДокумент();

//	Если ЗначениеЗаполнено(Этап.СсылкаНаЗадание) Тогда
//		Пересогласование = Этап.СсылкаНаЗадание.ПолучитьОбъект();
//		ЗаполнитьЗначенияСвойств(Задание, Пересогласование);
//		Задание.ЭффективныеЧасы.Загрузить(Пересогласование.ЭффективныеЧасы.Выгрузить());
//	КонецЕсли;
//	ЗаполнитьЗначенияСвойств(Задание, Этап);
//	Задание.Дата = ТекущаяДатаСеанса();
//	Задание.СсылкаНаЗадачу = РеквизитыСтруктурыЗадания.Владелец;
//	Задание.СсылкаНаСтруктуру = Этап;
//	Задание.Постановщик = РеквизитыСтруктурыЗадания.Владелец.Постановщик;
//	Задание.Подразделение = Задание.Исполнитель.Подразделение;
//	Задание.СсылкаНаЭтапТестирования = Этап.ПредыдущееЗадание;
//	Задание.УникальныйИдентификаторЗадания = Строка(Новый УникальныйИдентификатор);
//	Задание.Номер = "";
//	Задание.Записать(РежимЗаписиДокумента.Проведение);
//	Если РеквизитыЗадачи.ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.Предсогласованные Тогда
//		Списалось =  ЦБР_ЗадачиЗаданияВызовСервера.СписатьПредсогласованныеЧасы(РеквизитыСтруктурыЗадания.Владелец, Этап.ТрудозатратыПлан);
//	КонецЕсли;
//	Если ЗначениеЗаполнено(Пересогласование.Ссылка) Тогда
//		Уведомление = СтрШаблон("Изменено количество согласованных часов! Было: %1 Стало: %2", ?(
//			Пересогласование.ОплатаПоФакту, "По факту", Пересогласование.ТрудозатратыПлан), ?(Задание.ОплатаПоФакту,
//			"По факту", Задание.ТрудозатратыПлан));
//		Получатели = Новый Массив;
//		Получатели.Добавить(Задание.Постановщик);
//		ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Этап.Владелец, "ИзменениеОценки", Получатели, Уведомление);
//		ЦБР_ЗадачиЗаданияВызовСервера.ЗаменитьОсПоПересогласованию(Пересогласование.Ссылка, Задание.Ссылка);
//		УстановитьПривилегированныйРежим(Истина);
//		Пересогласование.Удалить();
//		УстановитьПривилегированныйРежим(Ложь);
//	КонецЕсли;
//		
//	СтруктураЗадачи = Этап.ПолучитьОбъект();
//	СтруктураЗадачи.СсылкаНаЗадание = Задание.Ссылка;
//	Если СтруктураЗадачи.ОплатаПоФакту Тогда  
//		СтруктураЗадачи.ТрудозатратыПланПредставление = "По факту";
//	КонецЕсли;
//	СтруктураЗадачи.Записать();   
//	
//КонецПроцедуры


#КонецОбласти
